DataProcessors/ЖурналЗаписиСтационар.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ЖурналЗаписиСтационар</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
						<v8:Type>cfg:CatalogRef.Палаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Палата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Палаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ДвижениеКоечногоФонда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДвижениеКоечногоФонда</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Палата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Палаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияКоек</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Койка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КойкоМеста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КлиентыСтационара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КлиентыСтационара</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КойкоМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КойкоМеста</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выписан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПоступления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаУсловийПребывания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОтображенияЯчеек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОтображенияЯчеек</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КлиентУслугиРаздельно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлиентУслугиВместе</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/БронированиеКойкоМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>БронированиеКойкоМеста</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостояниеКойкоМеста</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Палата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Палаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КойкоМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КойкоМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/КонфигурированиеЯчеекКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КонфигурированиеЯчеекКалендаря</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОтображения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтображенияЯчеек</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалитьВыводитьВремяВСвободныеЯчейкиЖЗ</Name>
					<Comment>Выводить время в свободные ячейки журнала записи</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалитьВыводитьКонтручастникаГрафикаВЖурналеЗаписи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалитьВыводитьКонтручастникаГрафикаВПервойСтроке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображениеЯчеекКабинетовКакУСотрудников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаДополнительнойКолонки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯчейкиКалендаря</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаДополнительногоПоля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛеваяГраницаАктуальностиЗаявок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПраваяГраницаАктуальностиЗаявок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЛинииСеткиВнутриЧаса</Name>
					<Comment>0 - пунктирная, 1 - сплошная (классическая)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменениеСостоянияЗаявкиТребуетПерерисовкиЖурналаЗаписи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>фВыводГрупповых</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоследовательностьОтображения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯчейкиКалендаря</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВТойЖеСтроке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазмещениеВЯчейках</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыОтображенияДополнительныхПолейРасписания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтображениеВидовВремениКабинетовСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПоляОтображенияГрафикаВРасписании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВПримечанииЯчейки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТолькоВПервойСтроке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СортировкаСубъектовРасписания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПолеСортировки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СортировкаСубъектовРасписанияРучнойПорядок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЦветаСубъектовРасписания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Цвет</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Специализация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкрашиваемыйЭлемент</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЖурналЗаписиСтационар/Ext/ObjectModule.bsl
// Параметры оформления календаря 
Перем мРазмерШрифтаШапки, мРазмерШрифтаОбщий, мРазмерШрифтаКлиент, 
	  мШрифтШапки, мШрифтОбщий, мШрифтЧас, мШрифтКлиент, мШрифтПериод,
      мШиринаКолонкиВремя,мШиринаКолонки;
Перем мВысотаСтроки, мВысотаСтрокиШапки;
Перем мСтруктураВизуальныхНастроек;

Перем мВремяНачалаДняКалендаря Экспорт; // Время, с которого начинается вывод календаря планирования

// Конечное значение диапазона выводимого времени в журнал записи
Перем мВремяОкончанияДняКалендаря; 

Перем мКвантПланирования Экспорт; // Периодичность планирования в секундах
Перем мУчетнаяПолитика Экспорт; // Параметры учетной политики для экспорта в форму

// Доплнительные Параметры оформления журнала 
Перем мКолонокВКолонкеДня, мВысотаЗаголовкаСтраницы, мЦветСвободныеКойкоМеста, мЦветФонаЗанятыеКойкоМеста, мЦветФонаПациентВСтационаре;
Перем мПерваяКолонкаРасписания;

Перем ВысотаШапки;
Перем МинимальнаяВысотаСтрокиЖурналаЗаписи Экспорт; // Минимальная высота строки интервала врменеи журнала записи

Перем мКэшДанныхКлиентов; 		// Кэш данных Клиентов 
Перем мКэшДопИнформацииКлиентов;// Кэш контактной информации клиентов

Перем ТекущиеКлиентыВСтационаре;
	
// Процедура создает структуру кэшей для хранения информации по активным Клиентам
Процедура ЗаполнитьКонстантыОтчета()
	
	мУчетнаяПолитика = УправлениеНастройками.ПолучитьУчетнуюПолитику();
	мУчетнаяПолитикаСтационар = УправлениеНастройкамиМедицинскогоУчета.ПолучитьУчетнуюПолитику();
	МинимальнаяВысотаСтрокиЖурналаЗаписи = 3;
	мСтруктураВизуальныхНастроек = ПолучитьВизуальныеНастройки();
	
	мРазмерШрифтаШапки	= 14;
	мРазмерШрифтаОбщий	= 10;
	мРазмерШрифтаЧас	= 10;
	мРазмерШрифтаПериод	= 10;
	мРазмерШрифтаКлиент	= 10;
	мШиринаКолонки		= 12;
	мВысотаСтроки = Макс(МинимальнаяВысотаСтрокиЖурналаЗаписи,мУчетнаяПолитикаСтационар.ВысотаСтрокиЖурналаЗаписи);
	мВремяНачалаДняКалендаря	= Дата(1,1,1);
	мВремяОкончанияДняКалендаря = Дата(1,1,1) + 86399;
	
	мКолонокВКолонкеДня = ?(мУчетнаяПолитикаСтационар.КоличествоИнтерваловВКолонкеДня = 0, 4, мУчетнаяПолитикаСтационар.КоличествоИнтерваловВКолонкеДня);
	мКвантПланирования = 86400 / мКолонокВКолонкеДня;
	мПерваяКолонкаРасписания = 4;

	ВысотаШапки 				= 2;
	мВысотаЗаголовкаСтраницы	= 0;
	мВысотаСтрокиШапки			= 14;
	мШиринаКолонкиВремя 		= 8;
	
    мШрифтШапки	 = Новый Шрифт(,мРазмерШрифтаШапки	, Истина);
	мШрифтОбщий	 = Новый Шрифт(,мРазмерШрифтаОбщий	, Ложь);                             
	мШрифтЧас	 = Новый Шрифт(,мРазмерШрифтаЧас	, Истина);
	мШрифтПериод = Новый Шрифт(,мРазмерШрифтаПериод	, Истина);
	
	мШрифтКлиент = мУчетнаяПолитика.ШрифтКлиент.Получить();
	Если мШрифтКлиент = Неопределено Тогда
		мШрифтКлиент  = Новый Шрифт(,мРазмерШрифтаКлиент);
	КонецЕсли;
	
	мЦветСвободныеКойкоМеста = мУчетнаяПолитикаСтационар.ОсновнойЦветСвободногоКойкоМеста.Получить();
	Если мЦветСвободныеКойкоМеста = Неопределено Тогда
		мЦветСвободныеКойкоМеста = Новый Цвет(245,230,235);
	КонецЕсли;
	
	мЦветФонаПациентВСтационаре = мУчетнаяПолитикаСтационар.ОсновнойЦветПациентВСтационаре.Получить();
	Если мЦветФонаПациентВСтационаре = Неопределено Тогда 
		мЦветФонаПациентВСтационаре = Новый Цвет(255,0,0);
	КонецЕсли;	
	
	мЦветФонаЗанятыеКойкоМеста = Новый Цвет(245,230,235);
	
КонецПроцедуры

// Формирует выборку отчета по койкоместам
Функция ПолучитьТаблицуОбъектовЖурналаЗаписи()

	Текст =	"";
	
	ТаблицаДатыПериода = Новый ТаблицаЗначений;
	ПолучитьДатыВПериоде(ТаблицаДатыПериода, ДатаНачала,ДатаОкончания);

	Текст = Текст + "ВЫБРАТЬ
	                |	ДатыПериода.ДеньПериода КАК ДеньПериода
	                |ПОМЕСТИТЬ ДатыПериода
	                |ИЗ
	                |	&ДатыПериода КАК ДатыПериода
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	0 КАК порядок1,
	                |	ДвижениеКоечногоФондаСрезПоследних.Палата КАК ВладелецОбъекта,
	                |	ДвижениеКоечногоФондаСрезПоследних.Койка КАК Объект,
	                |	ДвижениеКоечногоФондаСрезПоследних.Койка.Наименование КАК ОбъектПредставление,
	                |	ДвижениеКоечногоФондаСрезПоследних.Койка КАК КойкоМесто,
	                |	ДвижениеКоечногоФондаСрезПоследних.Палата.Подразделение.Код КАК ПорядокПодразделение,
	                |	ДвижениеКоечногоФондаСрезПоследних.Палата.Подразделение КАК Подразделение,
	                |	ДвижениеКоечногоФондаСрезПоследних.Палата.Подразделение.Филиал КАК Филиал,
	                |	ДвижениеКоечногоФондаСрезПоследних.Палата.Представление КАК ВладелецПредставление,
	                |	ДвижениеКоечногоФондаСрезПоследних.Койка.Представление КАК КойкоМестоПредставление
	                |ИЗ
	                |	РегистрСведений.ДвижениеКоечногоФонда.СрезПоследних КАК ДвижениеКоечногоФондаСрезПоследних
	                |ГДЕ
	                |	ДвижениеКоечногоФондаСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СостоянияКоек.ПустаяСсылка)
	                |	И ДвижениеКоечногоФондаСрезПоследних.Палата <> ЗНАЧЕНИЕ(Справочник.Палаты.Хранение)
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	ВладелецОбъекта,
	                |	Объект";
	
	Запрос = Новый Запрос;
	Запрос.Текст = Текст;
	
	Запрос.УстановитьПараметр("ДатыПериода", ТаблицаДатыПериода);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьЗапросПоДокументамСотрудников()
	
Возврат "ВЫБРАТЬ
        |	БронированиеКойкоМеста.Ссылка КАК ДокументСсылка,
        |	НАЧАЛОПЕРИОДА(БронированиеКойкоМеста.ДатаНачала, ДЕНЬ) КАК Дата,
        |	БронированиеКойкоМеста.КойкоМесто КАК ОБЪЕКТ,
        |	БронированиеКойкоМеста.Клиент.Представление КАК Клиент,
        |	БронированиеКойкоМеста.ДатаНачала КАК ДатаНачала,
        |	БронированиеКойкоМеста.ДатаОкончания,
        |	БронированиеКойкоМеста.Палата КАК ВладелецОбъекта,
        |	ЗНАЧЕНИЕ(Справочник.ВидыСостоянийКойкоМест.Бронь) КАК Состояние,
        |	БронированиеКойкоМеста.Клиент КАК КлиентСсылка
        |ПОМЕСТИТЬ ЗабронированныеПериоды
        |ИЗ
        |	Документ.БронированиеКойкоМеста КАК БронированиеКойкоМеста
        |ГДЕ
        |	(&ДатаНачала МЕЖДУ БронированиеКойкоМеста.ДатаНачала И БронированиеКойкоМеста.ДатаОкончания
        |			ИЛИ &ДатаОкончания МЕЖДУ БронированиеКойкоМеста.ДатаНачала И БронированиеКойкоМеста.ДатаОкончания
        |			ИЛИ &ДатаНачала <= БронированиеКойкоМеста.ДатаНачала
        |				И &ДатаОкончания >= БронированиеКойкоМеста.ДатаОкончания)
        |	И БронированиеКойкоМеста.Проведен
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |	КлиентыСтационараСрезПоследних.Клиент,
        |	КлиентыСтационараСрезПоследних.КойкоМесто,
        |	КлиентыСтационараСрезПоследних.ДатаНачала,
        |	КлиентыСтационараСрезПоследних.ДатаОкончания,
        |	КлиентыСтационараСрезПоследних.Регистратор КАК Документ
        |ПОМЕСТИТЬ КлиентыСтационараСрезПоследних
        |ИЗ
        |	РегистрСведений.КлиентыСтационара.СрезПоследних(, ) КАК КлиентыСтационараСрезПоследних
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |	КлиентыСтационараСрезПоследних.Документ КАК ДокументСсылка,
        |	НАЧАЛОПЕРИОДА(КлиентыСтационараСрезПоследних.ДатаНачала, ДЕНЬ) КАК Дата,
        |	КлиентыСтационараСрезПоследних.КойкоМесто КАК ОБЪЕКТ,
        |	КлиентыСтационараСрезПоследних.Клиент.Представление КАК Клиент,
        |	КлиентыСтационараСрезПоследних.ДатаНачала КАК ДатаНачала,
        |	КлиентыСтационараСрезПоследних.ДатаОкончания,
        |	КлиентыСтационараСрезПоследних.КойкоМесто.Владелец КАК ВладелецОбъекта,
        |	ЗНАЧЕНИЕ(Справочник.ВидыСостоянийКойкоМест.ЗанятоПациентом) КАК Состояние,
        |	КлиентыСтационараСрезПоследних.Клиент КАК КлиентСсылка
        |ПОМЕСТИТЬ ИзмененияУсловийПериоды
        |ИЗ
        |	КлиентыСтационараСрезПоследних КАК КлиентыСтационараСрезПоследних
        |ГДЕ
        |	(&ДатаНачала МЕЖДУ КлиентыСтационараСрезПоследних.ДатаНачала И КлиентыСтационараСрезПоследних.ДатаОкончания
        |			ИЛИ &ДатаОкончания МЕЖДУ КлиентыСтационараСрезПоследних.ДатаНачала И КлиентыСтационараСрезПоследних.ДатаОкончания
        |			ИЛИ &ДатаНачала <= КлиентыСтационараСрезПоследних.ДатаНачала
        |				И &ДатаОкончания >= КлиентыСтационараСрезПоследних.ДатаОкончания)
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |	КлиентыСтационараСрезПоследних.Клиент,
        |	КлиентыСтационараСрезПоследних.КойкоМесто КАК Объект
        |ПОМЕСТИТЬ КлиентыСтационараСрезПоследнихИтог
        |ИЗ
        |	КлиентыСтационараСрезПоследних КАК КлиентыСтационараСрезПоследних
        |ГДЕ
        |	КлиентыСтационараСрезПоследних.КойкоМесто <> ЗНАЧЕНИЕ(Справочник.КойкоМеста.ПустаяСсылка)
        |	И КлиентыСтационараСрезПоследних.КойкоМесто В(&Объекты)
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗЛИЧНЫЕ
        |	ВложенныйЗапрос.ДокументСсылка КАК ДокументСсылка,
        |	ВложенныйЗапрос.Дата КАК Дата,
        |	ВложенныйЗапрос.ОБЪЕКТ КАК ОБЪЕКТ,
        |	ВложенныйЗапрос.Клиент КАК Клиент,
        |	ВложенныйЗапрос.ДатаНачала КАК ДатаНачала,
        |	ВложенныйЗапрос.ДатаОкончания,
        |	ВложенныйЗапрос.ВладелецОбъекта КАК ВладелецОбъекта,
        |	ВложенныйЗапрос.ВладелецОбъекта.Подразделение.Код,
        |	ВложенныйЗапрос.ВладелецОбъекта.Подразделение,
        |	ВложенныйЗапрос.Состояние,
        |	ВложенныйЗапрос.КлиентСсылка КАК КлиентСсылка
        |ПОМЕСТИТЬ ТбИтог
        |ИЗ
        |	(ВЫБРАТЬ
        |		ЗабронированныеПериоды.ДокументСсылка КАК ДокументСсылка,
        |		ЗабронированныеПериоды.Дата КАК Дата,
        |		ЗабронированныеПериоды.ОБЪЕКТ КАК ОБЪЕКТ,
        |		ЗабронированныеПериоды.Клиент КАК Клиент,
        |		ЗабронированныеПериоды.ДатаНачала КАК ДатаНачала,
        |		ЗабронированныеПериоды.ДатаОкончания КАК ДатаОкончания,
        |		ЗабронированныеПериоды.ВладелецОбъекта КАК ВладелецОбъекта,
        |		ЗабронированныеПериоды.Состояние КАК Состояние,
        |		ЗабронированныеПериоды.КлиентСсылка КАК КлиентСсылка
        |	ИЗ
        |		ЗабронированныеПериоды КАК ЗабронированныеПериоды
        |	
        |	ОБЪЕДИНИТЬ ВСЕ
        |	
        |	ВЫБРАТЬ
        |		ИзмененияУсловийПериоды.ДокументСсылка,
        |		ИзмененияУсловийПериоды.Дата,
        |		ИзмененияУсловийПериоды.ОБЪЕКТ,
        |		ИзмененияУсловийПериоды.Клиент,
        |		ИзмененияУсловийПериоды.ДатаНачала,
        |		ИзмененияУсловийПериоды.ДатаОкончания,
        |		ИзмененияУсловийПериоды.ВладелецОбъекта,
        |		ИзмененияУсловийПериоды.Состояние,
        |		ИзмененияУсловийПериоды.КлиентСсылка
        |	ИЗ
        |		ИзмененияУсловийПериоды КАК ИзмененияУсловийПериоды) КАК ВложенныйЗапрос
        |ГДЕ
        |	ВложенныйЗапрос.ОБЪЕКТ В(&Объекты)
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |	ТбИтог.ДокументСсылка,
        |	ТбИтог.Дата,
        |	ТбИтог.ОБЪЕКТ,
        |	ТбИтог.Клиент,
        |	ТбИтог.ДатаНачала,
        |	ТбИтог.ДатаОкончания,
        |	ТбИтог.ВладелецОбъекта,
        |	ТбИтог.ВладелецОбъектаПодразделениеКод,
        |	ТбИтог.ВладелецОбъектаПодразделение,
        |	ТбИтог.Состояние,
        |	ТбИтог.КлиентСсылка,
        |	ВидыСостоянийКойкоМест.Цвет КАК СостояниеЦвет,
        |	ВЫБОР
        |		КОГДА ТбИтог.КлиентСсылка = КлиентыСтационараСрезПоследнихИтог.Клиент
        |			ТОГДА ИСТИНА
        |		ИНАЧЕ ЛОЖЬ
        |	КОНЕЦ КАК ТотЖеКлиент
        |ИЗ
        |	ТбИтог КАК ТбИтог
        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыСостоянийКойкоМест КАК ВидыСостоянийКойкоМест
        |		ПО ТбИтог.Состояние = ВидыСостоянийКойкоМест.Ссылка
        |		ЛЕВОЕ СОЕДИНЕНИЕ КлиентыСтационараСрезПоследнихИтог КАК КлиентыСтационараСрезПоследнихИтог
        |		ПО ТбИтог.ОБЪЕКТ = КлиентыСтационараСрезПоследнихИтог.Объект И ТбИтог.КлиентСсылка = КлиентыСтационараСрезПоследнихИтог.Клиент";

КонецФункции

Функция ТекущиеКлиентыВСтационаре(СписокОбъектов)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КлиентыСтационараСрезПоследних.Клиент КАК Клиент,
	|	КлиентыСтационараСрезПоследних.КойкоМесто КАК КойкоМесто,
	|	КлиентыСтационараСрезПоследних.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.КлиентыСтационара.СрезПоследних(, ) КАК КлиентыСтационараСрезПоследних
	|ГДЕ
	|	НЕ КлиентыСтационараСрезПоследних.Выписан
	|	И КлиентыСтационараСрезПоследних.КойкоМесто <> ЗНАЧЕНИЕ(Справочник.КойкоМеста.ПустаяСсылка)
	|	И КлиентыСтационараСрезПоследних.КойкоМесто В(&Объекты)
	|");
	
	Запрос.УстановитьПараметр("Объекты", СписокОбъектов);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//  ДокументРезультат - табличный документ, формируемый отчетом
//
Функция СформироватьОтчет() Экспорт
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ДокументРезультат.Область().ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ДокументРезультат.Область().ВертикальноеПоложение = ВертикальноеПоложение.Центр;

	ЗаполнитьКонстантыОтчета();
	
	ТаблицаОбъектов = ПолучитьТаблицуОбъектовЖурналаЗаписи();
	
	// Удаление строк отбором по подразделению.
	Если ЗначениеЗаполнено(Подразделение) Тогда
		УдалитьСтрокиЖурналаРегистрацииПоОтбору(ТаблицаОбъектов,Подразделение);
	КонецЕсли;
	ДопСерверныеФункции.СвернутьТаблицуЗначений(ТаблицаОбъектов);
	
	ТаблицаОбъектов.Сортировать("Порядок1, ПорядокПодразделение, ОбъектПредставление");
	
	Если ТаблицаОбъектов.Количество() > 0 Тогда 
		
		ТаблицаДатыПериода = Новый ТаблицаЗначений;
		ПолучитьДатыВПериоде(ТаблицаДатыПериода,ДатаНачала, ДатаОкончания);
		
		выбДокументов   = Неопределено;	
		выбКлиентов = Неопределено;	
		Объекты = ТаблицаОбъектов.ВыгрузитьКолонку("Объект");
		
		резДокументы = ПолучитьВыборкуДокументовОтчета(Объекты, выбДокументов);
		ВыбДокументы = резДокументы.Выгрузить();
		
		ТекущиеКлиентыВСтационаре = ТекущиеКлиентыВСтационаре(Объекты);

		// Определение времени начала и окончания за весь период
		ВремяНачалаДня    = мВремяНачалаДняКалендаря;
		ВремяОкончанияДня = мВремяОкончанияДняКалендаря;
		
		ТекДата = ДатаНачала;
		Пока ТекДата <= ДатаОкончания Цикл
			ОпределитьГраницыДня(резДокументы.Выбрать(), ТекДата,ВремяНачалаДня,ВремяОкончанияДня);
			ТекДата = ТекДата + 86400;
		КонецЦикла;
		
		ТаблицаДиапазонов = Новый ТаблицаЗначений;
		ТаблицаДиапазонов.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
		
		ВремяНачалаДняДляТЗ = ВремяНачалаДня;	
		ВремяКонцаДняДляТЗ	= ВремяОкончанияДня;
		КалендарьПланирования.ОкруглитьВремяДоПериодаПланирования(ВремяНачалаДняДляТЗ);
		КалендарьПланирования.ОкруглитьВремяДоПериодаПланирования(ВремяКонцаДняДляТЗ);
		
		Пока ВремяНачалаДняДляТЗ <= ВремяКонцаДняДляТЗ Цикл
			
			СтрокаДаты = ТаблицаДиапазонов.Добавить();
			СтрокаДаты.Дата		= ВремяНачалаДняДляТЗ;
			ВремяНачалаДняДляТЗ = ВремяНачалаДняДляТЗ + мКвантПланирования;
			
			Если НачалоДня(ВремяНачалаДняДляТЗ) > НачалоДня(ВремяНачалаДня) Тогда 
				ВремяНачалаДняДляТЗ = ВремяНачалаДняДляТЗ - 1;
			КонецЕсли;	
			
		КонецЦикла;
		
		// Сохранение перечня клиентов и номенклатуры заявок для формирования кэшей
		мКлиенты = Новый Массив();
		
		ВозвращаемыеДанныеДокументов = Новый Соответствие;
		
		ВыборкаДляДиапазонов = резДокументы.Выбрать();
		Пока ВыборкаДляДиапазонов.Следующий() Цикл
			Если ВыборкаДляДиапазонов.ДатаНачала <> ВыборкаДляДиапазонов.ДатаОкончания Тогда
				мКлиенты.Добавить(ВыборкаДляДиапазонов.КлиентСсылка);
				ВозвращаемыеДанныеДокументов.Вставить(ВыборкаДляДиапазонов.ДокументСсылка, ВыборкаДляДиапазонов.КлиентСсылка);
			КонецЕсли;
		КонецЦикла;
		
		СформироватьКэшДанныхДокументов(мКлиенты);

		ТаблицаДиапазонов.Свернуть("Дата");
		ТаблицаДиапазонов.Сортировать("Дата Возр");
		
		ТаблицаДиапазонов.Колонки.Добавить("Продолжительность", Новый ОписаниеТипов("Число"));
		ТаблицаДиапазонов.Колонки.Добавить("Период", Новый ОписаниеТипов("Число"));
		
		ПустаяДата = Дата(1,1,1);
		сч = 0;
		Для Каждого СтрокаДиапазона Из ТаблицаДиапазонов Цикл
			с = сч + 1;
			СтрокаДиапазона.Продолжительность = СтрокаДиапазона.Дата - ПустаяДата;
			СтрокаДаты.Период   = сч;
		КонецЦикла;
		
		// Получение табличных документов, содержащих пустую колонку сотрудника/оборудования нужной ширины и высоты
	    КолонкиДня = ПолучитьСтруктуруПустыхКолонокСеткиДня(Объекты.Количество());
		ТаблицаОбъектов.Сортировать("ВладелецПредставление, КойкоМестоПредставление");
		
	 	ВывестиКолонкиОбъектов(ДокументРезультат,ТаблицаОбъектов.Количество(),ТаблицаОбъектов);
		
		КолонкаНачалаВывода	= мПерваяКолонкаРасписания;
		ТекДата = ДатаНачала;
		Пока ТекДата <= ДатаОкончания Цикл
			СписокОбъектовНаДень = ПолучитьСписокОбъектовНаДень(ТаблицаОбъектов,ТекДата);
			Если СписокОбъектовНаДень.Количество() = 0 Тогда
				СписокОбъектовНаДень.Добавить(Справочники.КойкоМеста.ПустаяСсылка());
			КонецЕсли;
			
			ВывестиСеткуДняОтчета(СписокОбъектовНаДень, ТаблицаДатыПериода, ДокументРезультат,ТекДата,ВремяНачалаДня,ВремяОкончанияДня, КолонкаНачалаВывода, ТаблицаОбъектов, ТаблицаДиапазонов, КолонкиДня);
			
			ТекДата = ТекДата + 86400;
			КолонкаНачалаВывода = КолонкаНачалаВывода + мКолонокВКолонкеДня;
		КонецЦикла;
		
		КолонкаНачалаВывода	= мПерваяКолонкаРасписания;
		ВывестиДокументы(ТаблицаОбъектов,ДокументРезультат,ВыбДокументы,ТекДата,ВремяНачалаДня,ВремяОкончанияДня, КолонкаНачалаВывода, ТаблицаДатыПериода, ТаблицаДиапазонов);
	
		ВывестиТекущихКлиентовВСтационаре(ДокументРезультат);
	КонецЕсли;
	
	ДокументРезультат.ФиксацияСверху = ВысотаШапки;
	ДокументРезультат.ФиксацияСлева	 = мПерваяКолонкаРасписания - 1;
	
	// Ориентация страницы
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ДокументРезультат.ПолеСлева	= 10;
	ДокументРезультат.ПолеСправа = 0;
	
	// Присвоим имя для сохранения параметров печати табличного документа
	ДокументРезультат.ИмяПараметровПечати = "Журнал записи стационар";
	
	РезультатФормирования = Новый Структура;
	РезультатФормирования.Вставить("ДокументРезультат", ДокументРезультат);
	РезультатФормирования.Вставить("ДанныеДокументов", ВозвращаемыеДанныеДокументов);
	
	Возврат РезультатФормирования;

КонецФункции // СформироватьОтчет()

Процедура УдалитьСтрокиЖурналаРегистрацииПоОтбору(ТаблицаОбъектов,Подразделение)
	
	мОбрИнд = ТаблицаОбъектов.Количество()-1;
	Для сч = 0 по мОбрИнд Цикл
		
		СтрокаТаблицы = ТаблицаОбъектов[мОбрИнд-сч];
		Если ТипЗнч(Подразделение) = Тип("СправочникСсылка.Палаты") Тогда
			Если СтрокаТаблицы.ВладелецОбъекта <> Подразделение Тогда
				ТаблицаОбъектов.Удалить(мОбрИнд-сч);
			КонецЕсли;
		ИначеЕсли ТипЗнч(Подразделение) = Тип("СправочникСсылка.Подразделения") Тогда
			Если СтрокаТаблицы.Подразделение <> Подразделение Тогда
				ТаблицаОбъектов.Удалить(мОбрИнд-сч);
			КонецЕсли;
		Иначе // Филиал
			Если СтрокаТаблицы.Филиал <> Подразделение
				И ЗначениеЗаполнено(СтрокаТаблицы.Филиал)
			Тогда
				ТаблицаОбъектов.Удалить(мОбрИнд-сч);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

Функция ПолучитьВыборкуКойкоМест(ТаблицаОбъектов)
	
	Запрос = новый Запрос;
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ТаблицаОбъектов.Дата,
	 |	ТаблицаОбъектов.ВладелецОбъекта,
	 |	ТаблицаОбъектов.Объект,
	 |	ТаблицаОбъектов.ОбъектПредставление,
	 |	ТаблицаОбъектов.КойкоМесто,
	 |	ТаблицаОбъектов.ПорядокПодразделение,
	 |	ТаблицаОбъектов.Подразделение,
	 |	ТаблицаОбъектов.Филиал
	 |ПОМЕСТИТЬ ТаблицаОбъектов
	 |ИЗ
	 |	&ТаблицаОбъектов КАК ТаблицаОбъектов
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	0 КАК порядок1,
	 |	ТаблицаОбъектов.Дата,
	 |	ТаблицаОбъектов.ВладелецОбъекта,
	 |	ТаблицаОбъектов.Объект,
	 |	ТаблицаОбъектов.ОбъектПредставление,
	 |	ТаблицаОбъектов.КойкоМесто,
	 |	ТаблицаОбъектов.ПорядокПодразделение,
	 |	ТаблицаОбъектов.Подразделение,
	 |	ТаблицаОбъектов.Филиал
	 |ИЗ
	 |	ТаблицаОбъектов КАК ТаблицаОбъектов";

	Запрос.УстановитьПараметр("ТаблицаОбъектов"      ,ТаблицаОбъектов);
	Запрос.УстановитьПараметр("ДатаНачала"  		 ,ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания"		 ,ДатаОкончания);
	Запрос.УстановитьПараметр("УчетПоНесколькимФилиалам",ПараметрыСеанса.УчетПоНесколькимФилиалам);
	
	Если ТипЗнч(Подразделение) = Тип("СправочникСсылка.Подразделения") Тогда
		мПодразделение	= Подразделение;
		мФилиал			= Неопределено;
	ИначеЕсли	ТипЗнч(Подразделение) = Тип("СправочникСсылка.Сотрудники")
			Или	ТипЗнч(Подразделение) = Тип("СправочникСсылка.Оборудование") 
	Тогда
		мПодразделение	= Справочники.Подразделения.ПустаяСсылка();
		мФилиал			= Неопределено;
	Иначе
		мПодразделение	= Справочники.Подразделения.ПустаяСсылка();
		мФилиал			= ?(ЗначениеЗаполнено(Подразделение), Подразделение, Неопределено);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Подразделение",мПодразделение);
	Запрос.УстановитьПараметр("Филиал",мФилиал);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
КонецФункции

Функция ПолучитьВыборкуДокументовОтчета(СписокОбъектов, выбРаботыДокументов)
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("Объекты"      ,СписокОбъектов);
	Запрос.УстановитьПараметр("ДатаНачала"   ,ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(ДатаОкончания));
	Запрос.Текст = ПолучитьЗапросПоДокументамСотрудников();
	Результат = Запрос.Выполнить();
	
	ТабДокументов = Результат.Выгрузить();
	
	ТабДокументов.Колонки.Добавить("ДатаНачалаБлока"	, Новый ОписаниеТипов("Дата"));
	ТабДокументов.Колонки.Добавить("ДатаОкончанияБлока", Новый ОписаниеТипов("Дата"));
	ТабДокументов.Колонки.Добавить("НомерБлока"		, Новый ОписаниеТипов("Число"));
	
	ТабИнтервалыБлоков = ТабДокументов.СкопироватьКолонки("ДатаНачалаБлока,ДатаОкончанияБлока,НомерБлока");
	
	счБлоков	= -1;
	текСсылка	= Неопределено;
	текОбъект	= Неопределено;
	текДатаКон	= Неопределено;
	
	Для Каждого стрДок из ТабДокументов Цикл
		Если стрДок.ДокументСсылка <> текСсылка Или
			 стрДок.Объект		   <> текОбъект Или
			 стрДок.ДатаНачала 	   <> текДатаКон
		Тогда
			текСсылка = стрДок.ДокументСсылка;
			текОбъект = стрДок.Объект;
			счБлоков = счБлоков + 1;
		КонецЕсли;
		стрДок.НомерБлока = счБлоков;
		текДатаКон = стрДок.ДатаОкончания;
	КонецЦикла;
	
	Для сч = 0 по счБлоков Цикл
		Стр = ТабИнтервалыБлоков.Добавить();
		Стр.НомерБлока = сч;
	КонецЦикла;
	
	Для Каждого стрДок из ТабДокументов Цикл
		Если ТабИнтервалыБлоков[стрДок.НомерБлока].ДатаНачалаБлока = Дата(1,1,1) Тогда
			ТабИнтервалыБлоков[стрДок.НомерБлока].ДатаНачалаБлока = стрДок.ДатаНачала;
		КонецЕсли;
		ТабИнтервалыБлоков[стрДок.НомерБлока].ДатаОкончанияБлока = стрДок.ДатаОкончания;
		
	КонецЦикла;
	
	Для Каждого стрДок из ТабДокументов Цикл
		стрДок.ДатаНачалаБлока	  = ТабИнтервалыБлоков[стрДок.НомерБлока].ДатаНачалаБлока;
		стрДок.ДатаОкончанияБлока = ТабИнтервалыБлоков[стрДок.НомерБлока].ДатаОкончанияБлока;
	КонецЦикла;
	
	ТабДокументов.Колонки.СостояниеЦвет.Имя = "Цвет";
	ТабДокументов.Колонки.Добавить("СостояниеЦвет",Новый ОписаниеТипов("Строка"));
	Для Каждого стрДок из ТабДокументов Цикл
		стрДок.СостояниеЦвет = ?(стрДок.Цвет = NULL, "", ЗначениеВСтрокуВнутр(стрДок.Цвет.Получить()));
	КонецЦикла;
	ТабДокументов.Колонки.Удалить("Цвет");
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; 
	Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТабДокументы ИЗ &ТабДокументов как ТабДокументыСотрудников";
	Запрос.УстановитьПараметр("ТабДокументов", ТабДокументов);
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ТабДокументы ГДЕ ТабДокументы.ОБЪЕКТ <> ЗНАЧЕНИЕ(Справочник.КойкоМеста.ПустаяСсылка)";
	
	Возврат Запрос.Выполнить();	
	
КонецФункции

Функция ПолучитьСтруктуруПустыхКолонокСеткиДня(КоличествоСтрок)

	Макет = ПолучитьМакет("СеткиКолонкиЖурналаЗаписи");
	ОбластьСтрокиКолонки = Макет.ПолучитьОбласть("Колонки");
	
	ЧастыйПунктир = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.ЧастыйПунктир, 1);
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
	
	КолонкаДня = Новый ТабличныйДокумент;
	Для Сч = 1 По КоличествоСтрок Цикл
		КолонкаДня.Вывести(ОбластьСтрокиКолонки);
	КонецЦикла;
	
	Область = КолонкаДня.Область(1,1, КоличествоСтрок, мКолонокВКолонкеДня);
	// Область.Обвести(Линия, Линия, Линия, Линия);
	
	Результат = Новый Структура("КолонкаДня",Область);
	
	Возврат Результат;
	
КонецФункции

Процедура ВывестиСеткуДняОтчета(СписокОбъектов, ТаблицаДатыПериода,ДокументРезультат,Дата,ВремяНачалаДня,ВремяОкончанияДня, КолонкаНачалаВывода, ТаблицаОбъектов, ТаблицаДиапазонов,КолонкиДня)
	
	Если СписокОбъектов.Количество() = 0 Тогда Возврат КонецЕсли;
	
	вПозНач = ВысотаШапки+1;
	вПозКон = ВысотаШапки + СписокОбъектов.Количество();
	
	гПоз = КолонкаНачалаВывода;
	КолонкаШаблон = КолонкиДня.КолонкаДня;
	
	гПозКон = гПоз +  мКолонокВКолонкеДня - 1;
	ДокументРезультат.ВставитьОбласть(КолонкаШаблон, ДокументРезультат.Область(вПозНач,гПоз,вПозКон,гПозКон));
	
	ШиринаТаблицы = ДокументРезультат.ШиринаТаблицы;
	ВысотаТаблицы = ТаблицаОбъектов.Количество();
	
	ВывестиШапкуСтраницы(ТаблицаДатыПериода,ТаблицаДиапазонов,ДокументРезультат,ШиринаТаблицы,ВысотаТаблицы,КолонкаНачалаВывода,Дата);

    ПроставитьРасшифровкиПустыхЯчеек(ДокументРезультат,ШиринаТаблицы,ВысотаТаблицы,ВремяНачалаДня,КолонкаНачалаВывода, ТаблицаДиапазонов,ТаблицаОбъектов);
	
КонецПроцедуры

Процедура ВывестиШапкуСтраницы(СписокОбъектов,ТаблицаДиапазонов,ДокументРезультат,ШиринаТаблицы,ВысотаТаблицы,КолонкаНачалаВывода,Дата)
	
	ЛинияШапки = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
	
	ОбластьШапки = ДокументРезультат.Область(1,КолонкаНачалаВывода,ВысотаШапки,КолонкаНачалаВывода + мКолонокВКолонкеДня - 1);
	ОбластьШапки.АвтоВысотаСтроки = Истина;
	ОбластьШапки.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	ОбластьШапки.ЦветФона = Новый Цвет(240,240,240);
	ОбластьШапки.Шрифт = мШрифтШапки;
	
	ОбластьШапки.ГраницаСверху	= ЛинияШапки;
	ОбластьШапки.ГраницаСлева	= ЛинияШапки;
	ОбластьШапки.ГраницаСнизу	= ЛинияШапки;
	ОбластьШапки.ГраницаСправа	= ЛинияШапки;
	
	гПоз = КолонкаНачалаВывода;
	
	ОбластьДата = ДокументРезультат.Область(ВысотаШапки-1,гПоз,ВысотаШапки,гПоз + мКолонокВКолонкеДня-1);
	ОбластьДата.Объединить();
	ОбластьДата.Текст = Формат(Дата,"ДФ='dd MMMM'");
	
	ОбластьДата.Обвести(ЛинияШапки,ЛинияШапки,ЛинияШапки,ЛинияШапки);
	ОбластьДата.Расшифровка = Дата;

	Для сч = 1 По ТаблицаДиапазонов.Количество() - 1 Цикл 
		
		ОбластьДата = ДокументРезультат.Область(ВысотаШапки,гПоз+сч-1);
		ОбластьДата.ШиринаКолонки = мШиринаКолонкиВремя;
		ОбластьДата.Объединить();
		ОбластьДата.Шрифт = мШрифтПериод;
		ОбластьДата.Обвести(ЛинияШапки,ЛинияШапки,ЛинияШапки,ЛинияШапки);
	
	КонецЦикла;
	
	ДокументРезультат.Область(1,,1).АвтоВысотаСтроки = 0;
	ДокументРезультат.Область(1,,1).ВысотаСтроки	 = 0;

КонецПроцедуры

Процедура ПроставитьРасшифровкиПустыхЯчеек(ДокументРезультат,ШиринаТаблицы,ВысотаТаблицы,ВремяНачалаДня,КолонкаНачалаВывода, ТаблицаДиапазонов,ТаблицаОбъектов)
	
	гПоз=КолонкаНачалаВывода;

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТаблицаОбъектов.ВладелецОбъекта КАК ПалатаСсылка,
	                      |	ТаблицаОбъектов.ВладелецПредставление КАК ВладелецПредставление,
	                      |	ТаблицаОбъектов.Объект КАК КойкоМестоСсылка,
	                      |	ТаблицаОбъектов.КойкоМестоПредставление КАК КойкоМестоПредставление
	                      |ПОМЕСТИТЬ ТаблицаОбъектов
	                      |ИЗ
	                      |	&ТаблицаОбъектов КАК ТаблицаОбъектов
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТаблицаОбъектов.ПалатаСсылка КАК ПалатаСсылка,
	                      |	ТаблицаОбъектов.КойкоМестоСсылка КАК КойкоМестоСсылка,
	                      |	ТаблицаОбъектов.ВладелецПредставление,
	                      |	ТаблицаОбъектов.КойкоМестоПредставление
	                      |ИЗ
	                      |	ТаблицаОбъектов КАК ТаблицаОбъектов");
	Запрос.УстановитьПараметр("ТаблицаОбъектов",ТаблицаОбъектов);
	
	выбКойкоМеста = Запрос.Выполнить().Выгрузить();
	выбКойкоМеста.Сортировать("ВладелецПредставление,КойкоМестоПредставление");
	
	Объект	= ДокументРезультат.Область(ВысотаШапки + мВысотаЗаголовкаСтраницы,гПоз).Расшифровка;

	Дата = НачалоДня(ДокументРезультат.Область(1 + мВысотаЗаголовкаСтраницы,гПоз).Расшифровка);
	РазностьИнтервала = ВысотаШапки + 1 + мВысотаЗаголовкаСтраницы;
	
	Для сч = 1 По мКолонокВКолонкеДня Цикл 
		
		Для вПоз = РазностьИнтервала По ВысотаТаблицы + 2 Цикл
			СтруктураРасш = Новый Структура("ДатаНачала,Палата,КойкоМесто", Дата + ТаблицаДиапазонов[сч-1].Продолжительность,выбКойкоМеста[вПоз-3].ПалатаСсылка,выбКойкоМеста[вПоз-3].КойкоМестоСсылка);
			
			гПозКон = гПоз + мКолонокВКолонкеДня - 1;
			ОбластьЯчейки = ДокументРезультат.Область(вПоз,гПоз + сч - 1);
			ОбластьЯчейки.Расшифровка = СтруктураРасш;

			ОбластьЯчейки.ЦветФона = мЦветСвободныеКойкоМеста;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиДокументы(ТаблицаОбъектов,ДокументРезультат,ВыбДокументы,Дата,ВремяНачалаДня,ВремяОкончанияДня, КолонкаНачалаВывода, ТаблицаДатыПериода, ТаблицаДиапазонов)
	
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
	отбор = Новый Структура("Объект");
	гПоз = КолонкаНачалаВывода + ?(Дата=ДатаНачала,3,0);
	врНачСек = ВремяНачалаДня-НачалоДня(ВремяНачалаДня);

	инд = 0;
	Для Каждого стр Из ТаблицаОбъектов Цикл
		этоКойкоМесто = ТипЗнч(стр.Объект)= Тип("СправочникСсылка.КойкоМеста");
		Отбор.Объект = стр.Объект; 

		Если этоКойкоМесто Тогда
			инд = инд + 1;
			ВыбБлоки = ВыбДокументы.НайтиСтроки(Отбор);
			
			Если ВыбБлоки.Количество() > 0 Тогда
				
				Для Каждого Блок Из ВыбБлоки Цикл
					
					Если Блок.ДатаНачала < ДатаНачала Или Блок.ДатаНачала = ДатаНачала Тогда 
						НачПозВ = КолонкаНачалаВывода;
					Иначе 
						СтрокаДаты = ТаблицаДатыПериода.Найти(НачалоДня(Блок.ДатаНачала));
						Если СтрокаДаты <> Неопределено Тогда 
							ИндНачалаДень = ТаблицаДатыПериода.Индекс(СтрокаДаты);
							
							СтрокаНачалаДиапазона = ТаблицаДиапазонов.Найти(ПолучитьВремяНулевойДаты(Блок.ДатаНачала));
							Если СтрокаНачалаДиапазона <> Неопределено Тогда 
								НачПозИнт = ТаблицаДиапазонов.Индекс(СтрокаНачалаДиапазона) + КолонкаНачалаВывода;
							Иначе
								НачПозИнт = Цел(( (Блок.ДатаНачала - НачалоДня(Блок.ДатаНачала)) - врНачСек) / мКвантПланирования) + КолонкаНачалаВывода;
							КонецЕсли;
									
							НачПозВ = ИндНачалаДень * мКолонокВКолонкеДня + НачПозИнт;// - 1;
						Иначе 
							Продолжить;
						КонецЕсли;	
					КонецЕсли;
					
					Если Блок.ДатаОкончания >= ДатаОкончания Тогда 
						КонПозВ = КолонкаНачалаВывода + ТаблицаДатыПериода.Количество() * мКолонокВКолонкеДня - 1;
					Иначе
						Если Блок.ДатаОкончания = НачалоДня(Блок.ДатаОкончания) Тогда
							ДатаОкончанияБлока = Блок.ДатаОкончания - 1;
						Иначе
							ДатаОкончанияБлока = Блок.ДатаОкончания;
						КонецЕсли;
						
						СтрокаДаты = ТаблицаДатыПериода.Найти(НачалоДня(ДатаОкончанияБлока));
						Если СтрокаДаты <> Неопределено Тогда 
							ИндКонецДень = ТаблицаДатыПериода.Индекс(СтрокаДаты);
							
							СтрокКонцаДиапазона = ТаблицаДиапазонов.Найти(ПолучитьВремяНулевойДаты(ДатаОкончанияБлока));
							Если СтрокКонцаДиапазона <> Неопределено Тогда 
								КонПозИнт = ТаблицаДиапазонов.Индекс(СтрокКонцаДиапазона) + КолонкаНачалаВывода;
							Иначе
								КонПозИнт = Цел(( (ДатаОкончанияБлока - НачалоДня(ДатаОкончанияБлока)) - врНачСек) / мКвантПланирования) + КолонкаНачалаВывода;
							КонецЕсли;
									
							КонПозВ = ИндКонецДень * мКолонокВКолонкеДня + КонПозИнт;// - 1;
						Иначе 
							Продолжить;
						КонецЕсли;	
					КонецЕсли;
					
					// Определение цвета заявки
					Если Блок.Состояние.Пустая() И Не Блок.ТотЖеКлиент Тогда
						ЦветФонаТекДокумента = мЦветФонаЗанятыеКойкоМеста;
					ИначеЕсли Блок.ТотЖеКлиент Тогда 
						ЦветФонаТекДокумента = мЦветФонаПациентВСтационаре;
					Иначе 	
						ЦветФонаТекДокумента = ЗначениеИзСтрокиВнутр(Блок.СостояниеЦвет);
						Если ТипЗнч(ЦветФонаТекДокумента)<>Тип("Цвет") Тогда
							ЦветФонаТекДокумента = мЦветФонаЗанятыеКойкоМеста;
						КонецЕсли;
					КонецЕсли;
					
					Расшифровка	= Блок.ДокументСсылка;
					
					СтрокаОбъекта = ТаблицаОбъектов.Найти(Блок.Объект);
					Если СтрокаОбъекта <> Неопределено Тогда 
						гПоз = инд + ВысотаШапки;
					Иначе 
						Продолжить;
					КонецЕсли;
						
					мсПозВ = Новый Массив;
					Для счОбластей = НачПозВ По КонПозВ Цикл 
						ОбластьПроверки = ДокументРезультат.Область(гПоз,счОбластей);
						Если ТипЗнч(ОбластьПроверки.Расшифровка) <> Тип("Структура") Тогда 
							мсПозВ.Добавить(счОбластей);
						КонецЕсли;
					КонецЦикла;
					
					Если мсПозВ.Количество() > 0 Тогда 
						Если НачПозВ < мсПозВ[0] Тогда 
							ОбластьКлиент = ДокументРезультат.Область(гПоз,НачПозВ,гПоз,мсПозВ[0]-1);
						Иначе 
							// Ищем первую свободную область.
							Для счЭлементов = 0 По мсПозВ.Количество() - 2 Цикл
								Если мсПозВ[счЭлементов + 1] - мсПозВ[счЭлементов] = 1 Тогда
									// Это все еще заполненные ячейки.
								Иначе
									ОбластьКлиент = ДокументРезультат.Область(гПоз,мсПозВ[счЭлементов]+1,гПоз,мсПозВ[счЭлементов + 1] - 1);
									
									ОбластьКлиент.Объединить();
									ОбластьКлиент.Шрифт = мШрифтКлиент;
									ОбластьКлиент.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Обрезать;
									ОбластьКлиент.Расшифровка = Расшифровка;
									ОбластьКлиент.ЦветФона = ЦветФонаТекДокумента;	
									ОбластьКлиент.Текст = СформироватьСтрокуТекстаМонолит(Блок.КлиентСсылка,Блок,Истина);
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
						
					Иначе 
						
						ОбластьКлиент = ДокументРезультат.Область(гПоз,НачПозВ,гПоз,КонПозВ);
						ОбластьКлиент.Объединить();
						ОбластьКлиент.Шрифт = мШрифтКлиент;
						ОбластьКлиент.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Обрезать;
						ОбластьКлиент.Расшифровка = Расшифровка;
						ОбластьКлиент.ЦветФона = ЦветФонаТекДокумента;	
						ОбластьКлиент.Текст = СформироватьСтрокуТекстаМонолит(Блок.КлиентСсылка,Блок,Истина);
						
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура ОпределитьГраницыДня(ВыбДокументы, Дата,ВремяНачалаДня,ВремяОкончанияДня)
	
	Отбор = Новый Структура("Дата",Дата);
	вырНач = ВремяНачалаДня   -НачалоДня(ВремяНачалаДня);
	вырКон = ВремяОкончанияДня-НачалоДня(ВремяОкончанияДня);
	
	// Учет для границ времени документов
	мДатаДокНач = КонецДня(Дата);
	мДатаДокКон = НачалоДня(Дата);
	
	ВыбДокументы.Сбросить();
	Пока ВыбДокументы.НайтиСледующий(Отбор) Цикл
		
		мДатаДокНач = Мин (мДатаДокНач, ВыбДокументы.ДатаНачала);
		мДатаДокКон = Макс(мДатаДокКон, ВыбДокументы.ДатаОкончания);
		
	КонецЦикла;
	
	вырНач = Мин (вырНач, ОбщегоНазначения.ВремяВСекунды(мДатаДокНач));
	вырКон = Макс(вырКон, ОбщегоНазначения.ВремяВСекунды(мДатаДокКон));
	
	ВремяНачалаДня    = НачалоДня(ВремяНачалаДня) + вырНач;
	ВремяОкончанияДня = НачалоДня(ВремяОкончанияДня) + вырКон;
	
КонецПроцедуры

Функция ПолучитьСписокОбъектовНаДень(ТаблицаОбъектов,Дата)
	
	СписокОбъектов = Новый Массив();
	Для сч=0 по ТаблицаОбъектов.Количество()-1 Цикл
		
		СтрОбъекта = ТаблицаОбъектов[сч];
		Если СписокОбъектов.Найти(СтрОбъекта.Объект)=Неопределено Тогда
			
			СписокОбъектов.Добавить(СтрОбъекта.Объект);
			
		КонецЕсли;
		
	КонецЦикла;
	возврат СписокОбъектов;
КонецФункции

Функция ПолучитьВизуальныеНастройки()
	
	Результат = Новый Структура;
	ОсновнаяНастройкаЯчеек = Справочники.КонфигурированиеЯчеекКалендаря.ОсновнаяНастройка;
	
	Для Каждого Реквизит Из ОсновнаяНастройкаЯчеек.Метаданные().Реквизиты Цикл
		Результат.Вставить(Реквизит.Имя, ОсновнаяНастройкаЯчеек[Реквизит.Имя]);
	КонецЦикла;
	Результат.Вставить("ШиринаКолонкиКлиента",?(ОсновнаяНастройкаЯчеек.ВидОтображения = Перечисления.ВидыОтображенияЯчеек.КлиентУслугиРаздельно,4,0.25));
	Результат.Вставить("ПоследовательностьОтображения",ОсновнаяНастройкаЯчеек.ПоследовательностьОтображения);
	
	Возврат Результат;
		
КонецФункции

Функция РазделительТекстаЯчейки(Приёмник, ВТойЖеСтроке)
	
	Если ЗначениеЗаполнено(Приёмник) Тогда
		Если ВТойЖеСтроке Тогда
			Возврат " ";
		Иначе
			Возврат Символы.ПС;
		КонецЕсли;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

// Возвращает строку с информацией о клиенте в зависимости от последних двух параметров
Функция СформироватьСтрокуТекстаМонолит(Знач Клиент,ВыбРаботыБлока,ВозвращатьКлиент)
	
	РезультатнаяСтрока = "";
	УслугиЗаписаны = Ложь;
	Если Не ВозвращатьКлиент Тогда
		Возврат РезультатнаяСтрока;
	КонецЕсли;
	
	ЯчейкиКалендаря = Справочники.ЯчейкиКалендаря;
	
	АктуальныеЯчейки = Новый Массив;
	Для Каждого СтрокаНастройки Из мСтруктураВизуальныхНастроек.ПоследовательностьОтображения Цикл
		Если СтрокаНастройки.Ячейка.Родитель = ЯчейкиКалендаря.Клиент И ВозвращатьКлиент Тогда
			АктуальныеЯчейки.Добавить(Новый Структура("Ячейка, ВТойЖеСтроке", СтрокаНастройки.Ячейка, СтрокаНастройки.ВТойЖеСтроке));
		Иначе
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаНастройки Из АктуальныеЯчейки Цикл
		Значение = "";
		Отбор = Новый Структура("Ссылка",Клиент);
		Строки = мКэшДанныхКлиентов.НайтиСтроки(Отбор);
		Если Строки.Количество() > 0 Тогда
			
			ДанныеКлиента = Строки[0];
			
			Если СтрокаНастройки.Ячейка = ЯчейкиКалендаря.НаименованиеКлиента Тогда
				Значение = СокрЛП(ДанныеКлиента.Наименование);
				
			ИначеЕсли СтрокаНастройки.Ячейка = ЯчейкиКалендаря.ФамилияИОКлиента Тогда
				Значение = ОбщегоНазначения.ФамилияИнициалыФизЛица(,ДанныеКлиента.Фамилия, ДанныеКлиента.Имя, ДанныеКлиента.Отчество);
				
			ИначеЕсли СтрокаНастройки.Ячейка = ЯчейкиКалендаря.ФамилияКлиента Тогда
				Значение = СокрЛП(ДанныеКлиента.Фамилия);
			КонецЕсли;
			Если ЗначениеЗаполнено(Значение) Тогда					
				РезультатнаяСтрока	= РезультатнаяСтрока + РазделительТекстаЯчейки(РезультатнаяСтрока, СтрокаНастройки.ВТойЖеСтроке) 
									+ СокрЛП(Значение);
			КонецЕсли;					
		КонецЕсли;
	КонецЦикла;
	
	Возврат РезультатнаяСтрока;
	
КонецФункции

Функция ПолучитьВремяНулевойДаты(Дата)
	
	Возврат Дата(1,1,1) + Час(Дата) * 60 * 60 + Минута(Дата) * 60;
	
КонецФункции

Процедура СформироватьКэшДанныхДокументов(мКлиенты)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("мКлиенты", мКлиенты);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Клиенты.Ссылка КАК Ссылка,
	|	Клиенты.Наименование КАК Наименование,
	|	Клиенты.Фамилия КАК Фамилия,
	|	Клиенты.Имя КАК Имя,
	|	Клиенты.Отчество КАК Отчество,
	|	Клиенты.ДатаРождения КАК ДатаРождения,
	|	Клиенты.Комментарий
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	Клиенты.Ссылка В(&мКлиенты)";
	
	
	Результат = Запрос.Выполнить();
	мКэшДанныхКлиентов = Результат.Выгрузить();
	
	КалендарьПланирования.ОбновитьКэшДопИнформацииКлиентов(мКэшДопИнформацииКлиентов,мКлиенты);
	
КонецПроцедуры

Процедура ПолучитьДатыВПериоде(ТаблицаДатыПериода,ДатаНачалаПериода, ДатаОкончанияПериода)
	
	ТаблицаДатыПериода.Колонки.Добавить("ДеньПериода",Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	
	ДеньПериода = НачалоДня(ДатаНачалаПериода);
	
	Пока ДеньПериода <= ДатаОкончанияПериода Цикл 
		стрТБ = ТаблицаДатыПериода.Добавить();
		стрТБ.ДеньПериода = ДеньПериода;
		ДеньПериода = ДеньПериода + 86400;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиКолонкиОбъектов(ДокументРезультат,ВысотаТаблицы, ТаблицаОбъектов)
	
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
	
	// Вывод ячейки "Стационар" левый верхний угол.
	ЯчейкаСтр = ДокументРезультат.Область(1,1,ВысотаШапки,3);
	ЯчейкаСтр.Текст = "Стационар";
	ЯчейкаСтр.Шрифт = мШрифтКлиент;	
	ЯчейкаСтр.Объединить();
	
	ОбластьОбъекты = ДокументРезультат.Область(1,1,ВысотаТаблицы + ВысотаШапки,2);
	ОбластьОбъекты.ГраницаСверху	= Линия;
	ОбластьОбъекты.ГраницаСнизу	= Линия;

	ОбластьОбъекты.Обвести(Линия,Линия,Линия,Линия);
	ОбластьОбъекты.Шрифт = мШрифтОбщий;

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТаблицаОбъектов.ВладелецОбъекта КАК ПалатаСсылка,
	                      |	ТаблицаОбъектов.Объект КАК КойкоМестоСсылка
	                      |ПОМЕСТИТЬ ТаблицаОбъектов
	                      |ИЗ
	                      |	&ТаблицаОбъектов КАК ТаблицаОбъектов
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТаблицаОбъектов.ПалатаСсылка КАК ПалатаСсылка,
	                      |	ТаблицаОбъектов.КойкоМестоСсылка КАК КойкоМестоСсылка,
	                      |	ПРЕДСТАВЛЕНИЕ(ТаблицаОбъектов.ПалатаСсылка) КАК ПалатаПредставление,
	                      |	ПРЕДСТАВЛЕНИЕ(ТаблицаОбъектов.КойкоМестоСсылка) КАК КойкоМестоПредставление
	                      |ИЗ
	                      |	ТаблицаОбъектов КАК ТаблицаОбъектов
	                      |ИТОГИ ПО
	                      |	ПалатаСсылка");
	Запрос.УстановитьПараметр("ТаблицаОбъектов",ТаблицаОбъектов);
	
	Результат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// Определение самого длинного наименования палаты и койки.
	ДлинаПалаты = 0;
	ДлинаКойки	= 0;
	Пока Результат.Следующий() Цикл
		РезультатКойки = Результат.Выбрать();
		Пока РезультатКойки.Следующий() Цикл
			ДлинаПалаты = Макс(ДлинаПалаты,	 СтрДлина(СокрЛП(Результат.ПалатаПредставление)));
			ДлинаКойки	= Макс(ДлинаКойки,	 СтрДлина(СокрЛП(РезультатКойки.КойкоМестоПредставление)));
		КонецЦикла;
	КонецЦикла;
	
	// Вывод колонок;
	Результат.Сбросить();
	сч = 1;
	Пока Результат.Следующий() Цикл
		
		РезультатКойки = Результат.Выбрать();
		
		КоордХПер = сч + ВысотаШапки;
		Пока РезультатКойки.Следующий() Цикл
			ТекКоордХ = сч + ВысотаШапки;
			
			ЯчейкаПалата = ДокументРезультат.Область(ТекКоордХ,1);
			ЯчейкаПалата.Текст = Строка(Результат.ПалатаПредставление);
			ЯчейкаПалата.Расшифровка = Результат.ПалатаСсылка; 
			ЯчейкаПалата.ШиринаКолонки = ДлинаПалаты + 3;
			ЯчейкаПалата.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			ЯчейкаПалата.Обвести(Линия,Линия,Линия,Линия);
			
			ЯчейкаКойка = ДокументРезультат.Область(ТекКоордХ,2);
			ЯчейкаКойка.Текст = СокрЛП(РезультатКойки.КойкоМестоПредставление);
			ЯчейкаКойка.Расшифровка = РезультатКойки.КойкоМестоСсылка; 
			ЯчейкаКойка.ШиринаКолонки = ДлинаКойки + 3;
			ЯчейкаКойка.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
			
			сч = сч + 1;
		КонецЦикла;
		
		ОбластьПалаты =  ДокументРезультат.Область(КоордХПер,1,ТекКоордХ,1);
		ОбластьПалаты.Объединить();
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиТекущихКлиентовВСтационаре(ДокументРезультат)
	если ложь тогда ДокументРезультат = новый ТабличныйДокумент КонецЕсли;
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
	Картинка = КартинкаЗанятойКойки();
	
	// Оформление колонки.
	ОбластьТекущие = ДокументРезультат.Область(ВысотаШапки + 1,3);
	ОбластьТекущие.Обвести(Линия,Линия,Линия,Линия);
	ОбластьТекущие.ШиринаКолонки = 4;
	
	// Отрисовка картинки
	Для ТекКоордХ = (ВысотаШапки + 1) По ДокументРезультат.ВысотаТаблицы Цикл
		
		ОбластьТекущие = ДокументРезультат.Область(ТекКоордХ, 3);
		ОбластьТекущие.Обвести(Линия,Линия,Линия,Линия);
		
		ОбластьКойка = ДокументРезультат.Область(ТекКоордХ, 2);
		КойкоМесто = ОбластьКойка.Расшифровка;
		
		Если ТекущиеКлиентыВСтационаре <> Неопределено Тогда
			ТекущийНаКойке = ТекущиеКлиентыВСтационаре.Найти(КойкоМесто, "КойкоМесто");
			Если ТекущийНаКойке <> Неопределено Тогда
				
				ОбластьТекущие.Расшифровка = ТекущийНаКойке.Регистратор;
				ОбластьТекущие.РазмерКартинки = РазмерКартинки.РеальныйРазмер;
				ОбластьТекущие.Картинка = Картинка;
				ОбластьТекущие.ГоризонтальноеПоложениеКартинки = ГоризонтальноеПоложение.Центр;
				ОбластьТекущие.ВертикальноеПоложениеКартинки = ВертикальноеПоложение.Центр;
				
				// Отображение примечания, если бронь далее на другого.
				ВывестиПримечание = Ложь;
				Для Сч = мПерваяКолонкаРасписания По ДокументРезультат.ШиринаТаблицы Цикл
					ОбластьЛевее = ДокументРезультат.Область(ТекКоордХ, Сч);
					Если ЗначениеЗаполнено(ОбластьЛевее.Расшифровка)
						И ТипЗнч(ОбластьЛевее.Расшифровка) <> Тип("Структура") // Это не расшифровка свободной ячейки.
						Тогда
						КлиентРядом = ОбщегоНазначенияКлиентСервер.СвойствоОбъекта(ОбластьЛевее.Расшифровка, "Клиент");
						Если КлиентРядом = ТекущийНаКойке.Клиент Тогда
							Если Сч = мПерваяКолонкаРасписания Тогда 
								ОбластьТекущие.ЦветФона = ОбластьЛевее.ЦветФона;
							КонецЕсли;
						Иначе
							ВывестиПримечание = Истина;
						КонецЕсли;
						
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если ВывестиПримечание Тогда
					ОбластьТекущие.Примечание.Текст = Строка(ТекущийНаКойке.Клиент);
					ОбластьТекущие.Примечание.Расшифровка = ТекущийНаКойке.Регистратор;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
		
	КонецЦикла;
	
	Область = ДокументРезультат.Область(1,4, ДокументРезультат.ВысотаТаблицы, 4);
	Область.ГраницаСлева = Линия;
	
КонецПроцедуры

// Для переопределения расширениями.
Функция КартинкаЗанятойКойки()
	Возврат БиблиотекаКартинок.КойкоМесто_16х16;
КонецФункции
